soap/miniupnp/miniupnpd-2.1-igd2/seeds/31_WANIPC-GetListOfPortMappings_2

<?xml version="1.0" encoding="UTF-8"?><s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" ><s:Body><u:GetListOfPortMappings xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:2"><NewStartPort>5565</NewStartPort><NewEndPort>37238</NewEndPort><NewProtocol>UDP</NewProtocol><NewManage>0</NewManage><NewNumberOfPorts>19873</NewNumberOfPorts></u:GetListOfPortMappings></s:Body></s:Envelope>
